app/views/waitlists/cust_index.html.erb

                      <div class="text">
                        <% name = User.where(id: list.rest_id).first.name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]