app/views/waitlists/rest_index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---

                                            <% name = User.where(id: list.cust_id).first.name %>