app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("phone_number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["phone_number", 0], ["user_id", 10], ["created_at", "2015-10-24 03:16:29.153819"], ["updated_at", "2015-10-24 03:16:29.153819"]]

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE "customers" SET "user_id" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["user_id", 10], ["updated_at", "2015-10-24 03:16:29.185135"], ["id", 980191005]]

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 980191004]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 980191007]]