app/controllers/dynamic_pages_controller.rb

    def profile
        if user_signed_in?
            if current_user.rest
                if Restaurant.find_by_user_id(current_user.id) != nil
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."user_id" = $1 LIMIT 1  [["user_id", 6]]