app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
SELECT  "users".* FROM "users" WHERE (id) LIMIT 1
---
  def index
      # todo:
      # search each word: http://stackoverflow.com/questions/6337381/search-on-multiple-keywords-in-a-single-search-text-field-rails
      # search by relevance
      # autocomplete: https://rubygems.org/gems/autocomplete/versions/1.0.2
      # advance: https://www.youtube.com/watch?v=eUtUquKc2qQ
      # pg full text search: https://www.youtube.com/watch?v=pfZw6yErsX0

      # gem choice :
      # textacular
      @key = search_params[:key].present? ? search_params[:key] : ""
      @checkprice = search_params[:checkprice].present? ? search_params[:checkprice] : "false"
      @price = search_params[:price].present? ? search_params[:price] : "1"
      @checkrating = search_params[:checkrating].present? ? search_params[:checkrating] : "false"
      @rating = search_params[:rating].present? ? search_params[:rating] : "1"
      @category = search_params[:category].present? ? search_params[:category] : ""

      @restaurants = Restaurant.all

      # if has key to search for
      @restaurants = Restaurant.joins(:user).where("lower(name) LIKE ? OR lower(description) LIKE ? OR lower(rest_type) LIKE ? OR lower(city) LIKE ?", "%#{search_params[:key].downcase}%", "%#{search_params[:key].downcase}%", "%#{search_params[:key].downcase}%", "%#{search_params[:key].downcase}%") if search_params[:key].present?

      # if categories field is present
      @restaurants = @restaurants.where("lower(rest_type) LIKE ?","%#{search_params[:categories].downcase}%") if search_params[:categories].present?

SELECT "users".* FROM "users"
---
      # search by location :http://www.scribd.com/doc/2569355/Geo-Distance-Search-with-MySQL
      # search by open hour

      @users = User.all

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."user_id" = $1 LIMIT 1  [["user_id", 6]]
---
  def new
    if user_signed_in?
      if current_user.rest && Restaurant.find_by_user_id(current_user.id) == nil

INSERT INTO "hours" ("day_id", "open", "close", "rest_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # render text: restaurant_params
    url = "http://api.zippopotam.us/us/" + restaurant_params[:zip]
    uri = URI.parse(url)
    response = Net::HTTP.get_response(uri)
    if response.body == nil or response.body.empty? or response.body == '{}'
      flash[:error] = "restaurant zip code not valid"
      redirect_to restaurant_new_path
      return
    else
      response = JSON.parse(response.body)
      place = response['places']
      a = {}
      a[:lat] = place[0]['latitude']
      params[:restaurant][:lat] = place[0]['latitude']
      params[:restaurant][:lon] = place[0]['longitude']
    end

    @restaurant = Restaurant.new(restaurant_params)
    hours = restaurant_params[:hours_attributes]
    @hour = []
    hours.each  do |k, v|
      v[:day_id] = k.to_i + 1
      v[:rest_id] = restaurant_params[:user_id]
      @hour << Hour.new(v)

INSERT INTO "restaurants" ("user_id", "address", "hours", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 12], ["address", "a"], ["hours", "b"], ["created_at", "2015-10-20 19:43:16.504591"], ["updated_at", "2015-10-20 19:43:16.504591"]]
---
    end

    respond_to do |format|
      if @restaurant.save