app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("address", "hours", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "MLK"], ["hours", "24hr"], ["user_id", 10], ["created_at", "2015-10-22 03:11:38.706638"], ["updated_at", "2015-10-22 03:11:38.706638"]]
---
    end

    respond_to do |format|
      if @restaurant.save

UPDATE "restaurants" SET "address" = $1, "hours" = $2, "user_id" = $3, "updated_at" = $4 WHERE "restaurants"."id" = $5  [["address", "MLK1"], ["hours", "25hr"], ["user_id", 5], ["updated_at", "2015-10-24 03:16:29.032291"], ["id", 518579398]]
---
  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 980190962]]
---
    def set_restaurant
      @restaurant = Restaurant.find(params[:id])