app/controllers/waitlists_controller.rb

  def destroy
    @waitlist.destroy
---
DELETE FROM "waitlists" WHERE "waitlists"."id" = $1  [["id", 980190983]]

    def set_waitlist
      @waitlist = Waitlist.find(params[:id])
---
SELECT  "waitlists".* FROM "waitlists" WHERE "waitlists"."id" = $1 LIMIT 1  [["id", 980190983]]