app/controllers/waitlists_controller.rb

  def create
    cur_rest = params[:waitlist][:rest_id]
    cur_people = params[:waitlist][:people]
    cur_name = params[:waitlist][:name]
    # render text: params
    waitlist_params = {cust_id: current_user.id, rest_id: cur_rest, people: cur_people, name: cur_name}
    @waitlist = Waitlist.new(waitlist_params)
    if !@waitlist.valid?
      flash[:error] = "Number of People can't be blank"
      redirect_to waitlists_new_path(:rest_id => cur_rest)
      return
    end


    if @waitlist.check_params
      respond_to do |format|
        if @waitlist.save
---
INSERT INTO "waitlists" ("cust_id", "rest_id", "people", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cust_id", 1], ["rest_id", 1], ["people", 12], ["created_at", "2015-10-22 03:16:32.021520"], ["updated_at", "2015-10-22 03:16:32.021520"]]