app/controllers/users/registrations_controller.rb

INSERT INTO "customers" ("user_id", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["phone_number", 0], ["created_at", "2015-10-23 07:11:46.596176"], ["updated_at", "2015-10-23 07:11:46.596176"]]
---
  def create_user
    @this_param = sign_up_params
    @this_param[:rest] = false
    build_resource(@this_param)

    # save the new customer to database User
    resource.save
    yield resource if block_given?
    if resource.persisted?
      if resource.active_for_authentication?
        set_flash_message :notice, :signed_up if is_flashing_format?
        sign_up(resource_name, resource)
        respond_with resource, location: after_sign_up_path_for(resource)
      else
        set_flash_message :notice, :"signed_up_but_#{resource.inactive_message}" if is_flashing_format?
        expire_data_after_sign_in!
        respond_with resource, location: after_inactive_sign_up_path_for(resource)
      end
    else
      clean_up_passwords resource
      set_minimum_password_length
      flash[:notice] = flash[:notice].to_a.concat resource.errors.full_messages
      redirect_to signup_user_path
    end
    if resource.save
      # save the new restaurant to database Restaurant
      param = {user_id: resource.id, phone_number: 00000}
      @restaurant = Customer.new(param)
      @restaurant.save